stm32duino/Arduino_Tools/src/genpinmap/Arduino/STM32H7xx/STM32H747ZIYx/variant.h
/*
 *******************************************************************************
 * Copyright (c) 2021, STMicroelectronics
 * All rights reserved.
 *
 * This software component is licensed by ST under BSD 3-Clause license,
 * the "License"; You may not use this file except in compliance with the
 * License. You may obtain a copy of the License at:
 *                        opensource.org/licenses/BSD-3-Clause
 *
 *******************************************************************************
 */

#ifndef _VARIANT_ARDUINO_STM32_
#define _VARIANT_ARDUINO_STM32_
#ifdef __cplusplus
extern "C" {
#endif // __cplusplus

/*----------------------------------------------------------------------------
 *        STM32 pins number
 *----------------------------------------------------------------------------*/
#define PA0                     A0
#define PA1                     A1
#define PA2                     A2
#define PA3                     A3
#define PA4                     A4
#define PA5                     A5
#define PA6                     A6
#define PA7                     A7
#define PA8                     8
#define PA9                     9
#define PA10                    10
#define PA11                    11
#define PA12                    12
#define PA13                    13
#define PA14                    14
#define PA15                    15
#define PB0                     A8
#define PB1                     A9
#define PB2                     18
#define PB3                     19
#define PB4                     20
#define PB5                     21
#define PB6                     22
#define PB7                     23
#define PB8                     24
#define PB9                     25
#define PB10                    26
#define PB11                    27
#define PB12                    28
#define PB13                    29
#define PB14                    30
#define PB15                    31
#define PC0                     A10
#define PC1                     A11
#define PC4                     A12
#define PC5                     A13
#define PC6                     36
#define PC7                     37
#define PC8                     38
#define PC9                     39
#define PC10                    40
#define PC11                    41
#define PC12                    42
#define PC13                    43
#define PC14                    44
#define PC15                    45
#define PD0                     46
#define PD1                     47
#define PD2                     48
#define PD3                     49
#define PD4                     50
#define PD5                     51
#define PD6                     52
#define PD7                     53
#define PD8                     54
#define PD9                     55
#define PD10                    56
#define PD11                    57
#define PD12                    58
#define PD13                    59
#define PD14                    60
#define PD15                    61
#define PE0                     62
#define PE1                     63
#define PE2                     64
#define PE3                     65
#define PE4                     66
#define PE5                     67
#define PE6                     68
#define PE7                     69
#define PE8                     70
#define PE9                     71
#define PE10                    72
#define PE11                    73
#define PE12                    74
#define PE13                    75
#define PE14                    76
#define PE15                    77
#define PF0                     78
#define PF1                     79
#define PF2                     80
#define PF3                     A14
#define PF4                     A15
#define PF5                     A16
#define PF11                    A17
#define PF12                    A18
#define PF13                    A19
#define PF14                    A20
#define PF15                    88
#define PG0                     89
#define PG1                     90
#define PG2                     91
#define PG3                     92
#define PG4                     93
#define PG5                     94
#define PG8                     95
#define PG15                    96
#define PH0                     97
#define PH1                     98
#define PC2_C                   A21
#define PC3_C                   A22

// Alternate pins number
#define PA0_ALT1                (PA0   | ALT1)
#define PA1_ALT1                (PA1   | ALT1)
#define PA1_ALT2                (PA1   | ALT2)
#define PA2_ALT1                (PA2   | ALT1)
#define PA2_ALT2                (PA2   | ALT2)
#define PA3_ALT1                (PA3   | ALT1)
#define PA3_ALT2                (PA3   | ALT2)
#define PA4_ALT1                (PA4   | ALT1)
#define PA4_ALT2                (PA4   | ALT2)
#define PA5_ALT1                (PA5   | ALT1)
#define PA5_ALT2                (PA5   | ALT2)
#define PA5_ALT3                (PA5   | ALT3)
#define PA6_ALT1                (PA6   | ALT1)
#define PA7_ALT1                (PA7   | ALT1)
#define PA7_ALT2                (PA7   | ALT2)
#define PA7_ALT3                (PA7   | ALT3)
#define PA9_ALT1                (PA9   | ALT1)
#define PA10_ALT1               (PA10  | ALT1)
#define PA11_ALT1               (PA11  | ALT1)
#define PA12_ALT1               (PA12  | ALT1)
#define PA15_ALT1               (PA15  | ALT1)
#define PA15_ALT2               (PA15  | ALT2)
#define PB0_ALT1                (PB0   | ALT1)
#define PB0_ALT2                (PB0   | ALT2)
#define PB0_ALT3                (PB0   | ALT3)
#define PB1_ALT1                (PB1   | ALT1)
#define PB1_ALT2                (PB1   | ALT2)
#define PB3_ALT1                (PB3   | ALT1)
#define PB3_ALT2                (PB3   | ALT2)
#define PB4_ALT1                (PB4   | ALT1)
#define PB4_ALT2                (PB4   | ALT2)
#define PB5_ALT1                (PB5   | ALT1)
#define PB5_ALT2                (PB5   | ALT2)
#define PB6_ALT1                (PB6   | ALT1)
#define PB6_ALT2                (PB6   | ALT2)
#define PB7_ALT1                (PB7   | ALT1)
#define PB8_ALT1                (PB8   | ALT1)
#define PB8_ALT2                (PB8   | ALT2)
#define PB9_ALT1                (PB9   | ALT1)
#define PB9_ALT2                (PB9   | ALT2)
#define PB14_ALT1               (PB14  | ALT1)
#define PB14_ALT2               (PB14  | ALT2)
#define PB15_ALT1               (PB15  | ALT1)
#define PB15_ALT2               (PB15  | ALT2)
#define PC0_ALT1                (PC0   | ALT1)
#define PC0_ALT2                (PC0   | ALT2)
#define PC1_ALT1                (PC1   | ALT1)
#define PC1_ALT2                (PC1   | ALT2)
#define PC1_ALT3                (PC1   | ALT3)
#define PC1_ALT4                (PC1   | ALT4)
#define PC1_ALT5                (PC1   | ALT5)
#define PC2_C_ALT1              (PC2_C | ALT1)
#define PC4_ALT1                (PC4   | ALT1)
#define PC5_ALT1                (PC5   | ALT1)
#define PC5_ALT2                (PC5   | ALT2)
#define PC5_ALT3                (PC5   | ALT3)
#define PC6_ALT1                (PC6   | ALT1)
#define PC6_ALT2                (PC6   | ALT2)
#define PC7_ALT1                (PC7   | ALT1)
#define PC7_ALT2                (PC7   | ALT2)
#define PC8_ALT1                (PC8   | ALT1)
#define PC9_ALT1                (PC9   | ALT1)
#define PC10_ALT1               (PC10  | ALT1)
#define PC11_ALT1               (PC11  | ALT1)
#define PF4_ALT1                (PF4   | ALT1)
#define PF12_ALT1               (PF12  | ALT1)
#define PF14_ALT1               (PF14  | ALT1)

#define NUM_DIGITAL_PINS        101
#define NUM_DUALPAD_PINS        2
#define NUM_ANALOG_INPUTS       23

// On-board LED pin number
#ifndef LED_BUILTIN
#define LED_BUILTIN             PYn
#endif

// On-board user button
#ifndef USER_BTN
#define USER_BTN                PYn
#endif

// SPI definitions
#ifndef PIN_SPI_SS
#define PIN_SPI_SS              PA4
#endif
#ifndef PIN_SPI_SS1
#define PIN_SPI_SS1             PA15
#endif
#ifndef PIN_SPI_SS2
#define PIN_SPI_SS2             PYn
#endif
#ifndef PIN_SPI_SS3
#define PIN_SPI_SS3             PYn
#endif
#ifndef PIN_SPI_MOSI
#define PIN_SPI_MOSI            PA7
#endif
#ifndef PIN_SPI_MISO
#define PIN_SPI_MISO            PA6
#endif
#ifndef PIN_SPI_SCK
#define PIN_SPI_SCK             PA5
#endif

// I2C definitions
#ifndef PIN_WIRE_SDA
#define PIN_WIRE_SDA            PB7
#endif
#ifndef PIN_WIRE_SCL
#define PIN_WIRE_SCL            PB6
#endif

// Timer Definitions
// Use TIM6/TIM7 when possible as servo and tone don't need GPIO output pin
#ifndef TIMER_TONE
#define TIMER_TONE              TIM6
#endif
#ifndef TIMER_SERVO
#define TIMER_SERVO             TIM7
#endif

// UART Definitions
#ifndef SERIAL_UART_INSTANCE
#define SERIAL_UART_INSTANCE    4
#endif

// Default pin used for generic 'Serial' instance
// Mandatory for Firmata
#ifndef PIN_SERIAL_RX
#define PIN_SERIAL_RX           PA1
#endif
#ifndef PIN_SERIAL_TX
#define PIN_SERIAL_TX           PA0
#endif

// Extra HAL modules
#define HAL_DAC_MODULE_ENABLED
#define HAL_ETH_MODULE_ENABLED
#define HAL_QSPI_MODULE_ENABLED
#define HAL_SD_MODULE_ENABLED

#ifdef __cplusplus
} // extern "C"
#endif

/*----------------------------------------------------------------------------
 *        Arduino objects - C++ only
 *----------------------------------------------------------------------------*/

#ifdef __cplusplus
  // These serial port names are intended to allow libraries and architecture-neutral
  // sketches to automatically default to the correct port name for a particular type
  // of use.  For example, a GPS module would normally connect to SERIAL_PORT_HARDWARE_OPEN,
  // the first hardware serial port whose RX/TX pins are not dedicated to another use.
  //
  // SERIAL_PORT_MONITOR        Port which normally prints to the Arduino Serial Monitor
  //
  // SERIAL_PORT_USBVIRTUAL     Port which is USB virtual serial
  //
  // SERIAL_PORT_LINUXBRIDGE    Port which connects to a Linux system via Bridge library
  //
  // SERIAL_PORT_HARDWARE       Hardware serial port, physical RX & TX pins.
  //
  // SERIAL_PORT_HARDWARE_OPEN  Hardware serial ports which are open for use.  Their RX & TX
  //                            pins are NOT connected to anything by default.
  #define SERIAL_PORT_MONITOR   Serial
  #define SERIAL_PORT_HARDWARE  Serial
#endif

#endif /* _VARIANT_ARDUINO_STM32_ */